Repository: larmarange/prevR
Catalog: po/R-*.po
Languages: fr

source: the 'data' argument must be a dataframe.
fr: l'argument 'data' doit être un dataframe.

source: the projection %s, defined in the 'proj' argument, is incorect.
fr: la projection %s, définie dans l'argument 'proj' est incorrecte.

source: the class of 'boundary' must be SpatialPolygons.
fr: la class de 'boundary' doit être SpatialPolygons

source: No projection was defined in 'boundary' argument: 'boundary' has then be considered to be in the same projection (%s) as 'data'.
fr: Aucune projection n'a été définie dans l'argument 'boundary'. La projection retenue (%s) est celle de 'data'.

source: prevR.colors palettes for n=%d
fr: palettes prevR.colors pour n=%d

source: Select one country:
fr: Choisissez un pays :

source: Select countries (use CTRL):
fr: Choisissez plusieurs pays (utilisez la touche CTRL):

source: Source: World Borders Dataset 0.3 (2008) Provided by Bjorn Sandvik, http://thematicmapping.org/downloads/world_borders.php The dataset was derived by Schuyler Erle from public domain sources. Sean Gilles did some clean up and made some enhancements. The dataset is available under a Creative Commons Attribution-Share Alike License. http://creativecommons.org/licenses/by-sa/3.0/ The boundaries, names designations used do not imply official endorsement or acceptance by the authors.
fr: Source: World Borders Dataset 0.3 (2008) Mis à disposition par Bjorn Sandvik, http://thematicmapping.org/downloads/world_borders.php Ce jeu de données a été adapté par Schuyler Erle à partir de sources dand le domaine public. Sean Gilles a nettoyé le fichier et effectué quelques améliorations.. Ce jeu de donné est distribué sous licence Creative Commons Attribution-Share Alike. http://creativecommons.org/licenses/by-sa/3.0/ Les frontières et désignations employées n'impliquent l'expression d'aucune opinion ni acceptation de la part des auteurs.

source: Need colour or fill aesthetic to infer default direct labels.
fr: Les esthétiques colour ou fill sont nécessaires pour estimer les étiquettes

source: the 'element' argument must be 'clusters' or 'boundary'.
fr: l'argument 'element' doit être 'clusters' ou 'boundary'.

source: The package maptools is required to export boundary or clusters as shapefile. Please install it.
fr: Le package maptools est nécessaire pour exporter 'boundary' ou 'clusters' au format shapefile. Merci d'installer ce package.

source: the 'format' argument must be 'dbf', 'txt', 'csv', 'csv2' or 'shp'.
fr: l'argument format doit être 'dbf', 'txt', 'csv', 'csv2' ou 'shp'.

source: The package foreign is required to export to DBF. Please install it.
fr: Le package foreign est nécessaire pour exporter au format DBF. Merci de l'installer.

source: The package tcltk is required to use manual fit. Please install it.
fr: Le package tcltk est nécessaire pour utiliser l'ajustement manuel (fit='manual'). Merci de l'installer.

source: Parameters
fr: Paramètres

source: Max. Distance
fr: Distance Max.

source: Cov. Parameters
fr: Paramètres Cov.

source: Function
fr: Fonction

source: Choose this variogram
fr: Choisissez le variogramme

source: The package foreign is required to use import.dhs(). Please install it.
fr: Le package foreign est nécessaire pour exécuter la fonction import.dhs(). Merci de l'installer.

source: A window will open presenting the data contained in the file. Thank you to identify the following variables: - Cluster number (needed) - Longitude (decimal format in degrees, needed) - Latitude (decimal format in degrees, needed) - Clusters with missing coordinates (optional) - Clusters type (optional) Once the names of these variables identified, close the window so that the program can continue. Are you ready?
fr: Une fenêtre présentant les données contenues dans le fichier va s'ouvrir. Veuillez noter le nom des colonnes relatives aux variables suivantes : - Numéro de cluster (requis) - Longitude (en degrés avec décimales, requis) - Latitude (en degrés avec décimales, requis) - Clusters dont les coordonnées sont manquantes (optionel) - Type de clusters (optionel) Ensuite, fremez la fenêtre pour continuer le programme. Êtes-vous prêt?

source: Yes
fr: Oui

source: Please indicate the following variables:
fr: Veuillez indiquer les variables suivantes

source: * Cluster number (usually called DHSCLUST):
fr: * Numéro de cluster (le plus souvent il s'agit de DHSCLUST) :

source: * Longitude (decimal value, usually called LONGNUM):
fr: * Longitude (valeur décimale, le plus souvent il s'agit de LONGNUM):

source: * Latitude (decimal value, usually called LATNUM):
fr: * Latitude (valeur décimale, le plus souvent il s'agit de LATNUM) :

source: * Clusters with missing coordinates (optionnal, usually called SOURCE, type 0 if none):
fr: * Variable indiquant les clusters dont les coordonnées sont manquantes (optionnel, le plus souvent il s'agit de SOURCE, taper 0 si aucun) :

source: * Type of cluster (optionnal, type 0 if none):
fr: * Type de cluster (optionnel, sinon 0) :

source: Please check the following informations:
fr: Veuillez vérifier les informations suivantes :

source: * Cluster number:
fr: * Numéro de cluster

source: Not available - WARNING: this variable must be specified!
fr: Non disponile - ATTENTION : cette variable doit être renseignée!

source: * Longitude (decimal value):
fr: * Longitude (valeur décimale):

source: * Latitude (decimal value):
fr: * Latitude (valeur décimale):

source: * Clusters with missing coordinates (optionnal):
fr: * Clusters dont les coordonnées sont manquantes (optionnel) :

source: Not available
fr: Non disponible

source: * Type of cluster (optionnal):
fr: * Type de cluster (optionnel):

source: WARNING: cluster number must be specified!
fr: ATTENTION : le numéro des clusters doit être spécifié

source: WARNING: longitude must be specified!
fr: ATTENTION : la longitude doit être spécifiée!

source: WARNING: latitude number must be specified!
fr: ATTENTION : la latitude doit être spécifiéee!

source: WARNING: some problems were found (see above). You have to start again. Are you ready?
fr: ATTENTION : des problèmes ont été rencontrés (voir plus haut). Vous devez recommencer. Êtes-vous prêt?

source: Are these data correct?
fr: Ces données sont-elles correctes?

source: No
fr: Non

source: Please select the modality corresponding to missing coordinates (usually coded MIS).
fr: Sélectionnez la modalité correspond aux clusters dont les coordonnées sont manquantes (correspond à MIS le plus souvent).

source: Missing coordinates
fr: Systeme de coordonnées manquant

source: 1.1 VARIABLES SELECTION
fr: 1.1 SELECTION DES VARIABLES

source: * Cluster number (0 if not, will be calculated from individual identification number):
fr: * Numéro de cluster (0 si la variable n'existe pas. Le numéro de cluster sera alors calculé à partir des identifiants individuels.) :

source: * Individual identification number (0 if not):
fr: * Identifiant individuel (0 s'il n'existe pas) :

source: * Individual identification number or Cluster number must be specified.
fr: * L'dentifiant individuel ou le numéro de cluster doit être spécifié.

source: * Analyzed variable:
fr: * Variable analysée :

source: * Statistical weight (0 if not. All persons will have the same weight of 1.):
fr: * Poids statistique (0 s'il n'existe pas. Tous les individus auront un poids égal à 1.) :

source: * Individual identification number:
fr: * Identifiant individuel:

source: Not available - It will be calculated with individual identification number.
fr: Non renseigné - Il sera calculé à partir de l'identifiant individuel.

source: * Statistical weight:
fr: * Poids statistique

source: Not available - All persons will have a weight of 1.
fr: Non renseigné - Tous les individus auront un poids égal à 1.

source: WARNING: if cluster number not specified, you need to specify individual identification number!!
fr: ATTENTION : si le numéro de cluster n'est pas renseigné, vous devez spécifier l'identifiant individuel!

source: WARNING: you have to specify the analyzed variable!
fr: ATTENTION : vous devez spécifier la variable à analyser!

source: Please specify the modalities corresponding to a positive result (the analysed phenomenon occured), a negative result (not occured) and an undetermined result (considered as a missing value).
fr: Indiquez les modalités correspondant à un résultat positif (le phénomène étudié a eu lieu), à un résultat négatif (n'a pas eu lieu) et à un résultat indéterminé (considéré comme une valeur manquante).

source: Positive result
fr: Résultat positif

source: Negative result
fr: Résultat negatif

source: Undetermined result
fr: Résultat indéterminé

source: WARNING: You specified the same modality two times or you forgot one. Please start again. Are you ready?
fr: ATTENTION : Vous avez sélectionné une modalité deux fois, ou bien vous en avez oublié une. Veuillez recommencer. Êtes-vous prêt ?

source: * Positive result:
fr: * Résultat positif :

source: * Negative result:
fr: * Résultat negatif :

source: * Undetermined result:
fr: * Résultat indéterminé :

source: Often, in DHS, the weight variable have to be divided by a factor, usually 1'000'000.
fr: Souvent, dans les EDS, la variable poids doit être divisée par un facteur, le plus souvent 1 000 000.

source: The mean value of the weight variable is %.2f.
fr: La valeur moyenne de la variable poids est %.2f.

source: If this value is close to 1, the variable does not have to be modified. If it is close to 1'000'000, then it must be divided by this factor. Else consult the survey documentation.
fr: Si cette valeur est proche de 1, a priori la variable n'a pas à être modifiée. Si elle est proche de 1 000 000, alors elle doit être divisée par ce facteur, sinon consultez la documentation de l'enquête.

source: Does the weight variable have to be divided by a factor?
fr: La variable doit-elle être gardée telle quelle ou divisée par un facteur ?

source: No modification
fr: Pas de modification

source: Divided by 1'000'000
fr: Division par 1 000 000

source: Divided by an other factor
fr: Division par un autre facteur

source: Wich factor?
fr: Quel facteur de division ?

source: The cluster variable is not specified. It must be then calculated from the individual identification number. Usually in DHS, the cluster number corresponds to the first three digits of the individual identification number. You can see here three individual identification numbers selected at the beginning, the medium and the end of the file:
fr: La variable cluster n'est pas renseignée et doit donc être calculée à partir du numéro d'identifiant individuel. Le plus souvent, dans les EDS, le numéro de cluster correspond aux trois premiers chiffres du numéro d'identifiant individuel. Voici trois numéros d'identifiants individuels, pris au début, au mileu et à la fin du fichier :

source: - Individual identification number 1:
fr: - Premier identifiant individuel :

source: - Individual identification number 2:
fr: - Deuxième identifiant individuel :

source: - Individual identification number 3:
fr: - Troisième identifiant individuel :

source: Locate for each of them the cluster number. Among the various proposals below, which extracts the good cluster numbers?
fr: Repérez pour chacun d'eux le numéro de cluster. Parmi les différentes propositions ci-dessous, laquelle extrait les bons numéros de clusters ?

source: Select the correct cluster numbers:
fr: Sélectionnez les bons numérois de clusters :

source: STEP 1/3: DEFINE ANALYZED VARIABLE
fr: ETAPE 1/3 : DEFINITION DE LA VARIABLE A ANALYSER

source: STEP 2/3: CLUSTERS INFORMATION
fr: ETAPE 2/3 : INFORMATION SUR LES CLUSTERS

source: STEP 3/3: BOUNDARY OF THE COUNTRY
fr: ETAPE 3/3 : FRONTIERES DU PAYS

source: Do you want to define a boundary?
fr: Voulez-vous définir une frontière? :

source: The slot '%s' doesn't exist for class 'prevR'.
fr: Le slot '%s' n'existe pas dans la classe 'prevR'.

source: N is not numeric.
fr: N n'est pas numérique.

source: R is not numeric.
fr: R n'est pas numérique.

source: the input parameters are not valid: %s must have the same length or a length equal to 1.
fr: les paramètres d'entrée ne sont pas valides : %s doivent être de même longueur ou de longueur égale à 1

source: the slot 'rings' is empty: you have to run the rings function first.
fr: l'élément 'rings' est vide : vous devez d'abord exécuter la fonction rings().

source: 'wpos' and 'wn' are not present: the 'weighted' argument has been put at FALSE.
fr: 'wpos' et 'wn' sont absents : l'argument 'weighted' a été positionné à FALSE.

source: Progress of calculations:
fr: Progression des calculs

source: no data available for the variable '%s' with N=%s and R=%s.
fr: pas de données disponibles pour la variable '%s' avec N=%s et R=%s.

source: %s is not a valid formula: idw.prevR only implement simple or ordinary kriging, so formula must have only one variable and no predictor (like 'var~1').
fr: %s n'est pas une formule valide : idw.krige ne dispose que du krigeage simple ou ordinaire. En conséquence, la formule ne doit avoir qu'une variable, sans aucun prédicteur (ex : 'var~1').

source: the 'fit' argument must be 'auto' or 'manual'.
fr: l'argument 'fit' doit être 'auto' ou 'manual'

source: problem to fit the variogram: the variable '%s' width N=%s and R=%s has not been treated.
fr: problème pour ajuster le variogramme : la variable '%s' avec N=%s et R=%s n'a pas été traitée.

source: The packages geoR and tcltk are required to use manual fit. Please install it.
fr: Les packages geoR et tcltk sont nécessaires pour utiliser l'ajustement manuel (fit='manual'). Merci de les installer.

source: Error: select an other model.
fr: Erreur : choisissez un autre modèle.

source: %s is not a valid formula: idw.prevR only accept formula with only one variable and no predictor like 'var~1'.
fr: %s n'est pas une formmule valable : idw.prev n'accepte que les formules contenant une seule variable et aucun prédicteur du type 'var~1'.

source: Welcome to 'prevR': estimate regional trends of a prevalence.
fr: Bienvenue dans 'prevR' : Estimation des tendances régionales d'une prévalence

source: - type help('prevR') for details - type demo(prevR) for a demonstration - type citation('prevR') to cite prevR in a publication.
fr: - tapez help('prevR') pour les détails - tapez demo(prevR) pour une démonstration - tapez vignette('prevR-FR') pour la documentation en français - tapez citation('prevR') pour savoir comment citer prevR dans une publication.

source: the argument 'type' must be 'position', 'count', 'flower' or 'c.type'.
fr: l'argument 'type' doit être 'position', 'count', 'flower' ou 'c.type'.

source: No positive case
fr: Pas de cas positif

source: Only one positive case
fr: Un seul cas positif

source: One positive case by 'petal'
fr: Un cas positif par 'petal'

source: object must be of class prevR.
fr: objet doit être de classe 'prevR'

source: Package ggplot2 is required for plotting.
fr: Le package ggplot2 est requis pour afficher le graphique

source: Package directlabels is required for plotting.
fr: Le package directlabels est requis pour afficher le graphique

source: Package grid is required for plotting.
fr: Le package grid est requis pour afficher le graphique

source: No weighted data found in object.
fr: Aucune donnée pondérée trouvée dans object

source: the wn and wpos variables are coupled and you have only defined %s.
fr: les variables 'wn' et 'pos' sont couplées et vous n'avez défini que %s.

source: 'boundary' and 'clusters' didn't have the same projection.
fr: 'boundary' et 'clusters' n'avaient pas la même projection.

source: Object of class 'prevR'
fr: Objet de classe 'prevR'

source: Number of clusters: %i
fr: Nombre de clusters : %i

source: Number of observations: %i
fr: Nombre d'observations : %i

source: Number of positive cases: %i
fr: Nombre de cas positifs : %i

source: The dataset is weighted.
fr: Le jeu de données est pondéré.

source: The dataset is not weighted.
fr: Le jeu de données n'est pas pondéré.

source: National prevalence: %.2f%%
fr: Prévalence nationale : %.2f%%

source: National weighted prevalence: %.2f%%
fr: Prévalence nationale pondérée : %.2f%%

source: Projection used: %s
fr: Projection utilisée : %s

source: Coordinate range
fr: Domaine des cordonnées

source: Boundary coordinate range
fr: Domaine des coordonnées des frontières

source: Available (N,R) couples in the slot 'rings':
fr: Couples (N,R) disponibles dans le slot 'rings' :

source: SLOT RINGS FOR N=%s AND R=%s
fr: SLOT RINGS POUR N=%s ET R=%s

source: in the unit of the projection
fr: dans l'unité de la projection

source: in kilometers
fr: en kilomètres

source: QUANTILES OF r.radius (%s):
fr: QUANTILES DE r.radius (%s) :

source: the variable %s, defined in 'col', is not present in 'data'.
fr: la variable %s, definie dans 'col', n'est pas présente dans 'data'.

source: the variable %s is missing in 'col'.
fr: la variable %s est manquante dans 'col'.

source: The variable %s has been cancelled from 'data'.
fr: La variable %s a été supprimée de 'data'.

source: %s is not a valid country name.
fr: %s n'est pas un nom de pays valide

source: %s cluster was deleted due to missing values.
fr: %s cluster a été supprimé en raison de coordonnées manquantes.

source: %s cluster has latitude and longitude equal to 0. You should check if there is a variable in the dataset indicating clusters with missing coordinates.
fr: %s cluster a la valeur 0 pour longitude et latitude. Vous devriez vérifier dans le fichier de données s'il n'y aurait pas une variable indiquant les clusters dont les coordonnées sont manquantes.

source: the variable %s is missing.
fr: la variables %s est manquante
